Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties.CheckerName Property
 The name of the checker.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CheckerName { get; set; }
Public Property CheckerName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisModelJobProperties Class
Tekla.Structures.Analysis Namespace